tap "filosottile/musl-cross"
brew "cheat"
brew "colima", restart_service: :changed
brew "curl"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gnu-tar"
brew "helm"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "mas"  # Mac App Store command-line interface
brew "navi"
brew "openjdk@17"
brew "pyenv"
brew "ripgrep"
brew "skaffold"
brew "stern"
brew "tilt"
brew "tree"
brew "uv"
brew "wget"
brew "yq"
brew "filosottile/musl-cross/musl-cross"
cask "iterm2"
cask "multipass"
cask "stats"
cask "visual-studio-code"
mas "Boop", id: 1518425043
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Xcode", id: 497799835
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.makefile-tools"
